src/cfe/МенеджерСинхронизаций/Catalogs/МС_НастройкиСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_НастройкиСинхронизации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодНачалоПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВычисляемыйПериодОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаписыватьСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соединение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МС_НастройкиПодключений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиЗагрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НастройкаЗагрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МС_ЗапросыКВнешнимИсточникам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/Catalogs/МС_ЗапросыКВнешнимИсточникам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>МС_ЗапросыКВнешнимИсточникам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресатПерсонализированнойРассылки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтерактивнаяЗагрузка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьКодЗапроса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУведомления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияНовыхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОбработанныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогСохраненияОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьФайлыВЛокальныйКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодифицироватьИмяФайла</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Процедура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцедураПодготовкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗапросаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧЗначенияПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧНастройкаСоответствий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЧУведомления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьФайлыИзКаталогаИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиДоступности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПользователя</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Редактирование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/МенеджерСинхронизаций/CommonModules/МС_СинхронизацияСервер/Ext/Module.bsl
Процедура ЗаданиеСинхронизацияДанных(КодНастройки) Экспорт
	
	Если ЭтоКопияБазы() Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(КодНастройки) Тогда
		Возврат;
	КонецЕсли; 
	
	
	ВыключитьПривилегированныйРежим = Ложь;
	Если ПривилегированныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		ВыключитьПривилегированныйРежим = Истина;
	КонецЕсли; 

	НастройкаСинхронизации = Справочники.МС_НастройкиСинхронизации.НайтиПоКоду(КодНастройки);
	
	Если Не ЗначениеЗаполнено(НастройкаСинхронизации) Тогда
		Возврат;
	КонецЕсли; 
	
	Если НастройкаСинхронизации.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли; 
	
	РезультатЗагрузки = Справочники.МС_ЗапросыКВнешнимИсточникам.ВыполнитьЗагрузкуДокументов(НастройкаСинхронизации);
	
	Если ВыключитьПривилегированныйРежим = Истина Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Функция ЭтоКопияБазы() Экспорт

	Результат = Ложь;
	
	ВыключитьПривилегированныйРежим = Ложь;
	Если ПривилегированныйРежим() = Ложь Тогда
		УстановитьПривилегированныйРежим(Истина);
		ВыключитьПривилегированныйРежим = Истина;
	КонецЕсли; 

	
	ИнформацияОБазе = Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить();
	Если Не ИнформацияОБазе = Неопределено Тогда
		Резульат = ИнформацияОБазе.РаботаСВнешнимиРесурсамиЗаблокирована;
	КонецЕсли; 
	
	Если ВыключитьПривилегированныйРежим = Истина Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции

// Возвращает значение параметра указанного в табличной части ЗначенияПараметров справочника ЗапросыКВнешнимИсточникам
Функция ЗначениеПараметра(ЗначенияПараметров, ИмяПараметра) Экспорт
	
	СтрокаПараметра = ЗначенияПараметров.Найти(ИмяПараметра, "ИмяПараметра");
	Если СтрокаПараметра = Неопределено Тогда
		СтруктураОшибки = Новый Структура("Результат, Описание");
		СтруктураОшибки.Результат = "Ошибка";
		СтруктураОшибки.Описание = "В значениях параметров не указано значение параметра " + ИмяПараметра;
		Возврат Неопределено;
	Иначе
		Возврат СтрокаПараметра.ЗначениеПараметра;
	КонецЕсли; 
	
КонецФункции

Функция ЗаполнитьОбъектПоСтруктуре(СтруктураЗаполнения, ОбъектЗаполнения = Неопределено, ИзменятьПроведенные = Ложь) Экспорт
	
	Если ОбъектЗаполнения = Неопределено Тогда
		Если Не СтруктураЗаполнения.Свойство("ОбъектТип_") Тогда
			Возврат Неопределено;
		ИначеЕсли СтруктураЗаполнения.ОбъектТип_ = "Справочник" Тогда
			ОбъектЗаполнения = ПолучитьСправочникОбъект(СтруктураЗаполнения);
		ИначеЕсли СтруктураЗаполнения.ОбъектТип_ = "Документ" Тогда
			ОбъектЗаполнения = ПолучитьДокументОбъект(СтруктураЗаполнения, , ИзменятьПроведенные);
		Иначе
			// Пока нет других объектов
			Возврат Неопределено;
		КонецЕсли; 
	КонецЕсли; 
	
	Если ОбъектЗаполнения = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(ОбъектЗаполнения, СтруктураЗаполнения);
	
	Если СтруктураЗаполнения.Свойство("ТабличныеЧасти") Тогда
		Для каждого ТабличнаяЧасть Из СтруктураЗаполнения.ТабличныеЧасти Цикл
			ОбъектЗаполнения[ТабличнаяЧасть.Ключ].Очистить();
			Для каждого СтрокаТабличнаяЧасть Из ТабличнаяЧасть.Значение Цикл
				НоваяСтрока = ОбъектЗаполнения[ТабличнаяЧасть.Ключ].Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТабличнаяЧасть);
			КонецЦикла; 
		КонецЦикла; 
	
	КонецЕсли; 
	
	Возврат ОбъектЗаполнения;
	
КонецФункции

Функция ПолучитьДокументОбъект(СтруктураЗаполнения, СниматьПометкуУдаления = Ложь, ИзменятьПроведенные = Ложь) Экспорт
	
	// Поиск документов осуществляется по номеру в пределах интервала уникальности номера
	
	НовыйДокумент = Документы[СтруктураЗаполнения.ОбъектИмя_].НайтиПоНомеру(СтруктураЗаполнения.Номер, СтруктураЗаполнения.Дата);
	
	Если НовыйДокумент.Пустая() Тогда
		НовыйДокумент = Документы[СтруктураЗаполнения.ОбъектИмя_].СоздатьДокумент();
	Иначе
		Если СтруктураЗаполнения.НастройкаСинхронизации.ПерезаписыватьДокументы = Ложь Тогда
			НовыйДокумент = Неопределено;
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйДокумент, "Проведен") 
			И ИзменятьПроведенные = Ложь Тогда
			// Проведенные документы не обновляютя никогда
			НовыйДокумент = Неопределено;
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйДокумент, "ПометкаУдаления") 
			И СниматьПометкуУдаления = Ложь Тогда
			НовыйДокумент = Неопределено;
		ИначеЕсли ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НовыйДокумент, "ПометкаУдаления") 
			И СниматьПометкуУдаления = Истина Тогда
			НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
			НовыйДокумент.ПометкаУдаления = Ложь;
		Иначе
			НовыйДокумент = НовыйДокумент.ПолучитьОбъект();
		КонецЕсли; 
	КонецЕсли;
	
	Возврат НовыйДокумент;
	
КонецФункции

Функция ПолучитьСправочникОбъект(СтруктураЗаполнения) Экспорт
	
	Если Не СтруктураЗаполнения.Свойство("ОбъектТип_") 
		Или Не СтруктураЗаполнения.Свойство("ОбъектИмя_") Тогда
		Возврат Неопределено;
	ИначеЕсли Не СтруктураЗаполнения.Свойство("РеквизитыПоиска_") 
		Или СтруктураЗаполнения.РеквизитыПоиска_.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	СтрокаУсловияДляПоиска = "";
	
	Для каждого РеквизитПоиска Из СтруктураЗаполнения.РеквизитыПоиска_ Цикл
		СтрокаУсловияДляПоиска = СтрокаУсловияДляПоиска
									+ ?(ЗначениеЗаполнено(СтрокаУсловияДляПоиска), " И ", "")
									+ "СправочникДляПоиска_." + РеквизитПоиска + " = " + """" + СтруктураЗаполнения[РеквизитПоиска] + """";
	
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СправочникДляПоиска_.Ссылка КАК Ссылка
	|ИЗ
	|	" + СтруктураЗаполнения.ОбъектТип_ + "." + СтруктураЗаполнения.ОбъектИмя_ + " КАК СправочникДляПоиска_
	|ГДЕ
	|	" + СтрокаУсловияДляПоиска;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ЭлементОбъкет = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
	Иначе
		
		ЭлементОбъкет = Справочники[СтруктураЗаполнения.ОбъектИмя_].СоздатьЭлемент();
		
	КонецЕсли;
	
	Возврат ЭлементОбъкет;
	
КонецФункции

Функция ТаблицаЗначенийИзCOMОбъекта(ТаблицаОбъект, Типизировать = Истина) Экспорт
	
	ТаблицаДляВозврата = Новый("ТаблицаЗначений");
	
	// Инициализируем колонки
	Для НомерКолонки = 0 По ТаблицаОбъект.Fields.Count-1 Цикл
		ТаблицаДляВозврата.Колонки.Добавить(ТаблицаОбъект.Fields.Item(НомерКолонки).Name,,ТаблицаОбъект.Fields.Item(НомерКолонки).Name);
	КонецЦикла;
	
	// Перебор данных
	Пока ТаблицаОбъект.EOF() = 0 Цикл
		СтрокаТаблицыЗначений = ТаблицаДляВозврата.Добавить();
		Для НомерКолонки = 0 По ТаблицаОбъект.Fields.Count-1 Цикл
			СтрокаТаблицыЗначений[НомерКолонки] = ТаблицаОбъект.Fields(ТаблицаОбъект.Fields.Item(НомерКолонки).Name).Value;
		КонецЦикла;
		ТаблицаОбъект.MoveNext();
	КонецЦикла;
	
	ТаблицаОбъект.Close();
	
	Если Типизировать = Истина Тогда
		
		ТаблицаДляВозврата = МС_ОбщегоНазначенияСервер.ТипизироватьТаблицуЗначений(ТаблицаДляВозврата);
		
	КонецЕсли; 
	
	Возврат ТаблицаДляВозврата;
	
КонецФункции

Функция ПодключаемыеКомандыСинхронизации(ПараметрыПодключаемойФормы) Экспорт
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.МС_НастройкиСинхронизации) Тогда
		
		Если ПараметрыПодключаемойФормы.Свойство("ИмяФормы") Тогда
		
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка КАК Ссылка,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка.Наименование КАК НаименованиеСинхронизации,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка.Код КАК КодНастройки,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.НастройкаЗагрузки КАК НастройкаЗагрузки,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.НомерСтроки КАК НомерСтроки,
			|	МС_ЗапросыКВнешнимИсточникам.Наименование КАК НаименованиеЗагрузки,
			|	МС_ЗапросыКВнешнимИсточникам.ИнтерактивнаяЗагрузка КАК ИнтерактивнаяЗагрузка
			|ИЗ
			|	Справочник.МС_НастройкиСинхронизации.НастройкиЗагрузки КАК МС_НастройкиСинхронизацииПодключаемыеФормы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МС_ЗапросыКВнешнимИсточникам КАК МС_ЗапросыКВнешнимИсточникам
			|		ПО МС_НастройкиСинхронизацииПодключаемыеФормы.НастройкаЗагрузки = МС_ЗапросыКВнешнимИсточникам.Ссылка
			|ГДЕ
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.ПолноеИмяФормы ПОДОБНО &ИмяФормы
			|	И МС_НастройкиСинхронизацииПодключаемыеФормы.Активно";
			
			Запрос.УстановитьПараметр("ИмяФормы", "%" + ПараметрыПодключаемойФормы.ИмяФормы + "%");
			
			Возврат Запрос.Выполнить().Выгрузить();
			
		ИначеЕсли ПараметрыПодключаемойФормы.Свойство("НомерСтрокиНастройки") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка КАК Ссылка,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка.Наименование КАК НаименованиеСинхронизации,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка.Код КАК КодНастройки,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.НастройкаЗагрузки КАК НастройкаЗагрузки,
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.НомерСтроки КАК НомерСтроки,
			|	МС_ЗапросыКВнешнимИсточникам.Наименование КАК НаименованиеЗагрузки,
			|	МС_ЗапросыКВнешнимИсточникам.ИнтерактивнаяЗагрузка КАК ИнтерактивнаяЗагрузка
			|ИЗ
			|	Справочник.МС_НастройкиСинхронизации.НастройкиЗагрузки КАК МС_НастройкиСинхронизацииПодключаемыеФормы
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МС_ЗапросыКВнешнимИсточникам КАК МС_ЗапросыКВнешнимИсточникам
			|		ПО МС_НастройкиСинхронизацииПодключаемыеФормы.НастройкаЗагрузки = МС_ЗапросыКВнешнимИсточникам.Ссылка
			|ГДЕ
			|	МС_НастройкиСинхронизацииПодключаемыеФормы.Ссылка.Код = &КодНастройки
			|	И МС_НастройкиСинхронизацииПодключаемыеФормы.НомерСтроки = &НомерСтрокиНастройки
			|	И МС_НастройкиСинхронизацииПодключаемыеФормы.Активно";
			
			Запрос.УстановитьПараметр("КодНастройки", ПараметрыПодключаемойФормы.КодНастройки);
			Запрос.УстановитьПараметр("НомерСтрокиНастройки", Число(ПараметрыПодключаемойФормы.НомерСтрокиНастройки));
			
			Возврат Запрос.Выполнить().Выгрузить();
			
		КонецЕсли;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли; 
	
КонецФункции

Процедура ОбработкаКомандыСинхронизации(ПараметрКоманды, АдресХранилища) Экспорт
	
	РезультатЗагрузки = Справочники.МС_ЗапросыКВнешнимИсточникам.ВыполнитьЗагрузкуДокументов(ПараметрКоманды.НастройкаСинхронизации);
	
КонецПроцедуры

Процедура ВыполнитьСинхронизациюИзФормы(ПараметрыЗагрузки, АдресХранилища) Экспорт
	
	ДополнительныеПараметры = Новый Структура("ВызовИзФормы", Истина);
	ДополнительныеПараметры.Вставить("НомерСтрокиНастройки", ПараметрыЗагрузки.НомерСтрокиНастройки);
	
	ПодключаемыеСинхронизации = МС_СинхронизацияСервер.ПодключаемыеКомандыСинхронизации(ПараметрыЗагрузки);
	
	Для Каждого СтрокаСинхронизации из ПодключаемыеСинхронизации Цикл
		
		Если ПараметрыЗагрузки.Свойство("МассивСсылок") Тогда
			
			ДополнительныеПараметры.Вставить("МассивСсылок", ПараметрыЗагрузки.МассивСсылок);
			
		КонецЕсли;
		
		Справочники.МС_ЗапросыКВнешнимИсточникам.ВыполнитьЗагрузкуДокументов(СтрокаСинхронизации.Ссылка, , ДополнительныеПараметры);
			
	КонецЦикла;
	
КонецПроцедуры
 
Функция ВыборкаНастроекСинхронизации(НастройкиСинхронизации, ДополнительныеПараметры) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки КАК НастройкаЗагрузки,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.Соединение КАК Соединение,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.НачалоПериода КАК НачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ОкончаниеПериода КАК ОкончаниеПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериод КАК ВычисляемыйПериод,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодНачалоПериода КАК ВычисляемыйПериодНачалоПериода,
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка.ВычисляемыйПериодОкончаниеПериода КАК ВычисляемыйПериодОкончаниеПериода,
	|	МС_ЗапросыКВнешнимИсточникам.*
	|ИЗ
	|	Справочник.МС_НастройкиСинхронизации.НастройкиЗагрузки КАК МС_НастройкиСинхронизацииНастройкиЗагрузки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.МС_ЗапросыКВнешнимИсточникам КАК МС_ЗапросыКВнешнимИсточникам
	|		ПО МС_НастройкиСинхронизацииНастройкиЗагрузки.НастройкаЗагрузки = МС_ЗапросыКВнешнимИсточникам.Ссылка
	|ГДЕ
	|	МС_НастройкиСинхронизацииНастройкиЗагрузки.Ссылка = &Ссылка
	|	И МС_НастройкиСинхронизацииНастройкиЗагрузки.Активно
	|	И МС_НастройкиСинхронизацииНастройкиЗагрузки.НомерСтроки = &НомерСтрокиНастройки";
		
	Запрос.УстановитьПараметр("Ссылка", НастройкиСинхронизации);
	
	ВызовИзФормы = Ложь;
	НомерСтрокиНастройки = "";
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		
		Если ДополнительныеПараметры.Свойство("ВызовИзФормы") = Истина Тогда
			ВызовИзФормы = Истина;
			НомерСтрокиНастройки = ДополнительныеПараметры.НомерСтрокиНастройки;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ВызовИзФормы Тогда
		Запрос.УстановитьПараметр("НомерСтрокиНастройки", Число(НомерСтрокиНастройки));
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И МС_НастройкиСинхронизацииНастройкиЗагрузки.НомерСтроки = &НомерСтрокиНастройки", "");
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаДетальныеЗаписи;

КонецФункции

Функция СтруктураПараметровИзВыборкиНастроекСинхронизации(ВыборкаДетальныеЗаписи, ДополнительныеПараметры = Неопределено) Экспорт
	
	РезультатЗапроса = ВыборкаДетальныеЗаписи.Владелец();
	
	СтруктураПараметров = Новый Структура;
	
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		СтруктураПараметров.Вставить(Колонка.Имя,ВыборкаДетальныеЗаписи[Колонка.Имя]);
	КонецЦикла;
	
	// Вычисление периода
	Если СтруктураПараметров.ВычисляемыйПериод Тогда
		Выполнить("СтруктураПараметров.НачалоПериода = " + СтруктураПараметров.ВычисляемыйПериодНачалоПериода);
		Выполнить("СтруктураПараметров.ОкончаниеПериода = " + СтруктураПараметров.ВычисляемыйПериодОкончаниеПериода);
	Иначе
		СтруктураПараметров.ОкончаниеПериода = КонецДня(СтруктураПараметров.ОкончаниеПериода);
	КонецЕсли; 
	
	СтруктураПараметров.Вставить("ЗначенияПараметров", ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДетальныеЗаписи.ТЧЗначенияПараметров));
	СтруктураПараметров.Вставить("НастройкаСоответствий", ОбщегоНазначения.ЗначениеИзСтрокиXML(ВыборкаДетальныеЗаписи.ТЧНастройкаСоответствий));
	
	Если ДополнительныеПараметры <> Неопределено Тогда
		СтруктураПараметров.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	КонецЕсли;
	
	// Заполнение параметров из ДополнительныеПараметры.
	// Дополнительные параметры имеют более высокий приоритет и заменяют параметры в структуре параметров (например можно подменить дату)
	Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
		Для каждого ДополнительныйПараметр Из ДополнительныеПараметры Цикл
			СтруктураПараметров.Вставить(ДополнительныйПараметр.Ключ, ДополнительныйПараметр.Значение);
		КонецЦикла; 
	КонецЕсли;
	
	Возврат СтруктураПараметров;
	
КонецФункции

// Универсальная функция чтения табличного документа в таблицу значений для последующей обработки.
Функция ЗагрузкаИзТабличногоДокумента(НастройкаСинхронизации = Неопределено, СтруктураПараметров, ТабличныйДокумент, РезультатЗагрузки = Неопределено) Экспорт

	ЗначенияПараметров = МС_СинхронизацияСервер.ПараметрыСинхронизации(СтруктураПараметров.ЗначенияПараметров);
		
	СоответствиеКолонок = СоответствиеИзТаблицыСоответствий("НомерКолонки", СтруктураПараметров.НастройкаСоответствий);	
	
	ТаблицаЗначенийРезультат = Новый ТаблицаЗначений;
	
	Для каждого ЭлементСоответствиеКолонок Из СоответствиеКолонок Цикл
		
		ТаблицаЗначенийРезультат.Колонки.Добавить(ЭлементСоответствиеКолонок.Ключ);
		
	КонецЦикла; 
	
	Если ТабличныйДокумент.Области.Количество() = 0 Тогда
		
		ЗагрузкаИзОбластиТабличногоДокумента(ТабличныйДокумент, ТаблицаЗначенийРезультат, ЗначенияПараметров, СоответствиеКолонок, ТабличныйДокумент.ВысотаТаблицы);
		
	Иначе
		
		Для Каждого Область Из ТабличныйДокумент.Области Цикл
			
			ДанныеЛиста = ТабличныйДокумент.ПолучитьОбласть(Область.Имя);
			
			ЗагрузкаИзОбластиТабличногоДокумента(ДанныеЛиста, ТаблицаЗначенийРезультат, ЗначенияПараметров, СоответствиеКолонок, Область.Низ);
			
			//Для НомерСтроки = ЗначенияПараметров.Получить("НомерПервойСтроки") По Область.Низ Цикл
			//	
			//	НоваяСтрока = ТаблицаЗначенийРезультат.Добавить();
			//	
			//	Для каждого ЭлементСоответствиеКолонок Из СоответствиеКолонок Цикл
			//		
			//		НоваяСтрока[ЭлементСоответствиеКолонок.Ключ] = ДанныеЛиста.Область(НомерСтроки, ЭлементСоответствиеКолонок.Значение).Текст;
			//		
			//	КонецЦикла; 
			//	
			//КонецЦикла; 
			
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ТаблицаЗначенийРезультат;
	
КонецФункции

Функция ЗагрузкаИзОбластиТабличногоДокумента(ДанныеЛиста, ТаблицаЗначенийРезультат, ЗначенияПараметров, СоответствиеКолонок, ВысотаТаблицы) Экспорт
	
	Для НомерСтроки = ЗначенияПараметров.Получить("НомерПервойСтроки") По ВысотаТаблицы Цикл
		
		НоваяСтрока = ТаблицаЗначенийРезультат.Добавить();
		
		Для каждого ЭлементСоответствиеКолонок Из СоответствиеКолонок Цикл
			
			НоваяСтрока[ЭлементСоответствиеКолонок.Ключ] = ДанныеЛиста.Область(НомерСтроки, ЭлементСоответствиеКолонок.Значение).Текст;
			
		КонецЦикла; 
		
	КонецЦикла; 
	
КонецФункции

Функция СоответствиеИзТаблицыСоответствий(Тип, НастройкаСоответствий) Экспорт

	Результат = Новый Соответствие;
	Отбор = Новый Структура;
	Отбор.Вставить("Тип", Тип);
	ТаблицаСоответствий = НастройкаСоответствий.НайтиСтроки(Отбор);
	
	Для Каждого Стр Из ТаблицаСоответствий Цикл
		Результат.Вставить(Стр.Ключ, Стр.Значение);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

// Устарела, см СтруктураПараметровСинхронизации
// Возвращает соответствие параметров синхронизации
Функция ПараметрыСинхронизации(ТаблицаПараметров) Экспорт
	
	ЗначенияПараметров = Новый Соответствие;
	
	Для Каждого Стр Из ТаблицаПараметров Цикл
		ЗначенияПараметров.Вставить(Стр.ИмяПараметра, Стр.ЗначениеПараметра);
	КонецЦикла;
	
	Возврат ЗначенияПараметров;

КонецФункции

// Возвращает структуру параметров синхронизации
Функция СтруктураЗначенийПараметровСинхронизации(ТаблицаПараметров) Экспорт
	
	ЗначенияПараметров = Новый Структура;
	
	Для Каждого Стр Из ТаблицаПараметров Цикл
		ЗначенияПараметров.Вставить(Стр.ИмяПараметра, Стр.ЗначениеПараметра);
	КонецЦикла;
	
	Возврат ЗначенияПараметров;

КонецФункции

Функция СвойстваПоследнегоФоновогоЗаданияВыполненияРегламентногоЗадания(ПараметрыСинхронизации) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МС_НастройкиСинхронизации.ИдентификаторРегламентногоЗадания КАК ИдентификаторРегламентногоЗадания
	|ИЗ
	|	Справочник.МС_НастройкиСинхронизации КАК МС_НастройкиСинхронизации
	|ГДЕ
	|	МС_НастройкиСинхронизации.Ссылка = &НастройкаСинхронизации
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	МС_НастройкиСинхронизации.ИдентификаторРегламентногоЗадания
	|ИЗ
	|	Справочник.МС_НастройкиСинхронизации КАК МС_НастройкиСинхронизации
	|ГДЕ
	|	МС_НастройкиСинхронизации.Код = &КодНайстройкиСинхронизации";
	
	Запрос.УстановитьПараметр("НастройкаСинхронизации", ПараметрыСинхронизации.НастройкаСинхронизации);
	Запрос.УстановитьПараметр("КодНайстройкиСинхронизации", ПараметрыСинхронизации.КодНастройки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторРегламентногоЗадания", Строка(Выборка.ИдентификаторРегламентногоЗадания));
		Отбор.Вставить("ПолучитьПоследнееФоновоеЗаданиеРегламентногоЗадания");
		ТаблицаСвойствФоновыхЗаданий = РегламентныеЗаданияСлужебный.СвойстваФоновыхЗаданий(Отбор);
		ТаблицаСвойствФоновыхЗаданий.Сортировать("Конец Возр");
		
		Если ТаблицаСвойствФоновыхЗаданий.Количество() = 0 Тогда
			СвойстваФоновогоЗадания = Неопределено;
		ИначеЕсли НЕ ЗначениеЗаполнено(ТаблицаСвойствФоновыхЗаданий[0].Конец) Тогда
			СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[0];
		Иначе
			СвойстваФоновогоЗадания = ТаблицаСвойствФоновыхЗаданий[ТаблицаСвойствФоновыхЗаданий.Количество()-1];
		КонецЕсли;
		
		Возврат СвойстваФоновогоЗадания;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Процедура ВывестиСообщенияФоновогоЗадания(Параметры) Экспорт
	
	Если ТипЗнч(Параметры) = Тип("Структура") Тогда
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Параметры.ИдентификаторЗадания);
		Если ФоновоеЗадание <> Неопределено Тогда
			
			Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
				
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Ошибка выполнения синхронизации по причине
					|%1';
					|
					|en = 'An error occurred while executing sinhronization. Reason:
					|%1.'"),
					КраткоеПредставлениеОшибки(ФоновоеЗадание.ИнформацияОбОшибке));
					
					Сообщить(ТекстОшибки);
					
			КонецЕсли;
			
			МассивСообщений = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
			Если МассивСообщений <> Неопределено Тогда
				Для каждого СообщениеФоновогоЗадания Из МассивСообщений Цикл
					СообщениеФоновогоЗадания.Сообщить();
				КонецЦикла;
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЕсли;
			
КонецПроцедуры
